---

C#Visual BasicVisual C++

Revit 2024 API
---
ComboBox..::..AddItem Method
ComboBox Class See Also Send Feedback
---

Adds a new item to the ComboBox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011

# Syntax

C#
---

    public ComboBoxMember AddItem(
    	ComboBoxMemberData memberData
    )

Visual Basic
---

    Public Function AddItem ( _
    	memberData As ComboBoxMemberData _
    ) As ComboBoxMember

Visual C++
---

    public:
    ComboBoxMember^ AddItem(
    	ComboBoxMemberData^ memberData
    )

#### Parameters

memberData
    Type: Autodesk.Revit.UI..::..ComboBoxMemberDataAn object containing the data needed to construct the ComboBoxMember.

#### Return Value

The newly added ComboBoxMember.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when memberData is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when button with memberData.Name already exists in the drop-down list. |

# See Also

ComboBox Class

Autodesk.Revit.UI Namespace